approved-problems/kapture-dependency-closed-subset/verify/mutants/01-file-records-only.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -22,9 +22,7 @@ from kapture.io.structure import delete_existing_kapture_files
 
 
 RECORD_ATTRIBUTES = (
-    'records_camera', 'records_depth', 'records_lidar', 'records_wifi',
-    'records_bluetooth', 'records_gnss', 'records_accelerometer',
-    'records_gyroscope', 'records_magnetic',
+    'records_camera', 'records_depth', 'records_lidar',
 )
 FILE_RECORD_ATTRIBUTES = ('records_camera', 'records_depth', 'records_lidar')
 FEATURE_ATTRIBUTES = {
