approved-problems/kapture-dependency-closed-subset/verify/mutants/02-direct-rigs-only.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -111,14 +111,10 @@ def subset_kapture(kapture_data: kapture.Kapture,
     retained_rig_ids: Set[str] = set()
     if kapture_data.rigs is not None:
         required_nodes = set(retained_sensor_ids)
-        changed = True
-        while changed:
-            changed = False
-            for rig_id, rig in kapture_data.rigs.items():
-                if rig_id not in required_nodes and any(member_id in required_nodes for member_id in rig):
-                    required_nodes.add(rig_id)
-                    retained_rig_ids.add(rig_id)
-                    changed = True
+        for rig_id, rig in kapture_data.rigs.items():
+            if any(member_id in retained_sensor_ids for member_id in rig):
+                required_nodes.add(rig_id)
+                retained_rig_ids.add(rig_id)
         rigs = kapture.Rigs()
         for rig_id, rig in kapture_data.rigs.items():
             if rig_id not in retained_rig_ids:
