approved-problems/kapture-dependency-closed-subset/verify/mutants/04-filter-keypoints-only.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -137,8 +137,8 @@ def subset_kapture(kapture_data: kapture.Kapture,
 
     retained_images = set(result.records_camera.data_list()) if result.records_camera is not None else set()
     result.keypoints = _filter_feature_collection(kapture_data.keypoints, retained_images)
-    result.descriptors = _filter_feature_collection(kapture_data.descriptors, retained_images)
-    result.global_features = _filter_feature_collection(kapture_data.global_features, retained_images)
+    result.descriptors = copy.deepcopy(kapture_data.descriptors)
+    result.global_features = copy.deepcopy(kapture_data.global_features)
 
     if kapture_data.matches is not None:
         matches_collection = {}
