approved-problems/kapture-dependency-closed-subset/verify/mutants/05-match-either-endpoint.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -146,7 +146,7 @@ def subset_kapture(kapture_data: kapture.Kapture,
         for feature_type, matches in kapture_data.matches.items():
             retained_matches = kapture.Matches()
             for image1, image2 in matches:
-                if image1 in retained_images and image2 in retained_images:
+                if image1 in retained_images or image2 in retained_images:
                     retained_matches.add(image1, image2)
             if retained_matches:
                 matches_collection[feature_type] = retained_matches
