approved-problems/kapture-dependency-closed-subset/verify/mutants/06-points-not-compacted.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -168,8 +168,7 @@ def subset_kapture(kapture_data: kapture.Kapture,
                 kept_observations.append((point_id, filtered))
 
         if kept_observations:
-            point_ids = [point_id for point_id, _ in kept_observations]
-            result.points3d = kapture.Points3d(np.array(kapture_data.points3d[point_ids], copy=True))
+            result.points3d = kapture.Points3d(np.array(kapture_data.points3d, copy=True))
             observations = kapture.Observations()
             for new_point_id, (_, per_type) in enumerate(kept_observations):
                 for feature_type, values in per_type.items():
