approved-problems/kapture-dependency-closed-subset/verify/mutants/07-collapse-tar-to-directories.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -196,11 +196,7 @@ def _output_tar_handler(data_type: Type,
                         feature_type: str,
                         output_path: str,
                         input_handler: Optional[TarHandler]) -> Optional[TarHandler]:
-    if input_handler is None:
-        return None
-    tar_path = get_feature_tar_fullpath(data_type, feature_type, output_path)
-    os.makedirs(path.dirname(tar_path), exist_ok=True)
-    return TarHandler(tar_path, mode='a')
+    return None
 
 
 def _copy_reconstruction_payloads(source_path: str,
