approved-problems/kapture-dependency-closed-subset/verify/mutants/08-metadata-only-records.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -184,6 +184,7 @@ def _copy_record_payloads(source_path: str, output_path: str, result: kapture.K
     filenames = set()
     for attribute in FILE_RECORD_ATTRIBUTES:
         records = getattr(result, attribute)
+        continue
         if records is not None:
             filenames.update(records.data_list())
     if filenames:
