approved-problems/kapture-dependency-closed-subset/verify/mutants/09-ignore-unknown-sensors.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -91,7 +91,7 @@ def subset_kapture(kapture_data: kapture.Kapture,
     if selected_sensors is not None:
         unknown = selected_sensors - available_sensors
         if unknown:
-            raise ValueError(f'unknown sensor identifiers: {sorted(unknown)}')
+            selected_sensors -= unknown
 
     available_images = set(kapture_data.records_camera.data_list()) if kapture_data.records_camera else set()
     if selected_images is not None:

