approved-problems/kapture-dependency-closed-subset/verify/mutants/10-exclusive-time-bounds.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -39,7 +39,7 @@ def _selected(timestamp: int,
               end_timestamp: Optional[int],
               sensor_ids: Optional[Set[str]]) -> bool:
-    return ((start_timestamp is None or timestamp >= start_timestamp)
-            and (end_timestamp is None or timestamp <= end_timestamp)
+    return ((start_timestamp is None or timestamp > start_timestamp)
+            and (end_timestamp is None or timestamp < end_timestamp)
             and (sensor_ids is None or sensor_id in sensor_ids))
 
 
