approved-problems/kapture-dependency-closed-subset/verify/mutants/14-empty-record-payloads.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -188,8 +188,11 @@ def _copy_record_payloads(source_path: str, output_path: str, result: kapture.K
         if records is not None:
             filenames.update(records.data_list())
     if filenames:
-        import_record_data_from_dir_auto(get_record_fullpath(source_path), output_path,
-                                         sorted(filenames), TransferAction.copy)
+        for filename in sorted(filenames):
+            destination = get_record_fullpath(output_path, filename)
+            os.makedirs(path.dirname(destination), exist_ok=True)
+            with open(destination, 'wb'):
+                pass
 
 
 def _output_tar_handler(data_type: Type,
