approved-problems/kapture-dependency-closed-subset/verify/mutants/15-skip-match-payloads.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -215,6 +215,7 @@ def _copy_reconstruction_payloads(source_path: str,
             output_handler = _output_tar_handler(data_type, feature_type, output_path, input_handler)
             try:
                 if data_type == kapture.Matches:
+                    continue
                     for pair in entries:
                         source_file = kapture.io.features.get_matches_fullpath(
                             pair, feature_type, source_path, input_handler)
