approved-problems/kapture-dependency-closed-subset/verify/mutants/16-first-sensor-only.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -84,7 +84,8 @@ def subset_kapture(kapture_data: kapture.Kapture,
     """
     if start_timestamp is not None and end_timestamp is not None and start_timestamp > end_timestamp:
         raise ValueError('start_timestamp must not exceed end_timestamp')
-    selected_sensors = (None if sensor_ids is None else
-                        ({sensor_ids} if isinstance(sensor_ids, str) else set(sensor_ids)))
+    selected_sensors = (None if sensor_ids is None else {
+        sensor_ids if isinstance(sensor_ids, str) else next(iter(sensor_ids))
+    })
     selected_images = (None if image_ids is None else
                        ({image_ids} if isinstance(image_ids, str) else set(image_ids)))

