approved-problems/kapture-dependency-closed-subset/verify/mutants/17-ignore-one-sided-bounds.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -39,7 +39,8 @@ def _selected(timestamp: int,
               end_timestamp: Optional[int],
               sensor_ids: Optional[Set[str]]) -> bool:
-    return ((start_timestamp is None or timestamp >= start_timestamp)
-            and (end_timestamp is None or timestamp <= end_timestamp)
+    bounds_active = start_timestamp is not None and end_timestamp is not None
+    return ((not bounds_active or timestamp >= start_timestamp)
+            and (not bounds_active or timestamp <= end_timestamp)
             and (sensor_ids is None or sensor_id in sensor_ids))
 
 
