approved-problems/kapture-dependency-closed-subset/verify/mutants/19-discard-saved-return.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -386,7 +386,7 @@ def subset_kapture_from_dir(source_path: str,
 
         if not output_existed:
             os.replace(staged_path, output_path)
-            return result
+            return None
 
         shutil.copytree(output_path, candidate_path, symlinks=True)
         _remove_managed_files(candidate_path, managed_files)
@@ -399,6 +399,6 @@ def subset_kapture_from_dir(source_path: str,
             os.replace(backup_path, output_path)
             raise
         shutil.rmtree(backup_path, ignore_errors=True)
-        return result
+        return None
     finally:
         shutil.rmtree(transaction_root, ignore_errors=True)

