approved-problems/kapture-dependency-closed-subset/verify/mutants/20-assume-record-families-present.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -52,7 +52,5 @@ def _filter_records(records,
                     allowed_timestamps: Optional[Set[int]] = None,
                     retained_values: Optional[Set[str]] = None):
-    if records is None:
-        return None
     result = type(records)()
     for timestamp, per_sensor in records.items():
         for sensor_id, value in per_sensor.items():
