approved-problems/kapture-dependency-closed-subset/verify/mutants/21-raw-same-path-check.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -294,10 +294,10 @@ def subset_kapture_from_dir(source_path: str,
     Reconstruction payloads preserve each source feature collection's ordinary
     directory or tar-backed storage mode.
     """
+    if source_path == output_path:
+        raise ValueError('source and output paths must be different')
     source_path = path.realpath(path.abspath(source_path))
     output_path = path.realpath(path.abspath(output_path))
-    if source_path == output_path:
-        raise ValueError('source and output paths must be different')
     if path.lexists(output_path) and not path.isdir(output_path):
         raise ValueError('output path must be a directory')

