approved-problems/kapture-dependency-closed-subset/verify/mutants/22-missing-entrypoint-callable.patch
diff --git a/tools/kapture_subset.py b/tools/kapture_subset.py
index 8fd73a6..4f5182a 100644
--- a/tools/kapture_subset.py
+++ b/tools/kapture_subset.py
@@ -8,7 +8,7 @@ import argparse
 from kapture.algo.subset import subset_kapture_from_dir
 
 
-def subset_command_line() -> None:
+def main() -> None:
     parser = argparse.ArgumentParser(description='create a self-contained subset of a kapture dataset')
     parser.add_argument('-i', '--input', required=True, help='input kapture dataset')
     parser.add_argument('-o', '--output', required=True, help='output kapture dataset')
@@ -24,4 +24,4 @@ def subset_command_line() -> None:
 
 
 if __name__ == '__main__':
-    subset_command_line()
+    main()
