approved-problems/kapture-dependency-closed-subset/verify/mutants/23-shallow-model-values.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -59,5 +59,5 @@ def _filter_records(records,
                     and (allowed_timestamps is None or timestamp in allowed_timestamps)
                     and (retained_values is None or value in retained_values)):
-                result[timestamp, sensor_id] = copy.deepcopy(value)
+                result[timestamp, sensor_id] = copy.copy(value)
     return result or None
 
@@ -127,7 +127,7 @@ def subset_kapture(kapture_data: kapture.Kapture,
 
     if kapture_data.sensors is not None:
         result.sensors = kapture.Sensors({
-            sensor_id: copy.deepcopy(kapture_data.sensors[sensor_id])
+            sensor_id: copy.copy(kapture_data.sensors[sensor_id])
             for sensor_id in kapture_data.sensors
             if sensor_id in retained_sensor_ids
         })
@@ -145,6 +145,6 @@ def subset_kapture(kapture_data: kapture.Kapture,
                 continue
             for member_id, pose in rig.items():
                 if member_id in required_nodes:
-                    rigs[rig_id, member_id] = copy.deepcopy(pose)
+                    rigs[rig_id, member_id] = copy.copy(pose)
         result.rigs = rigs or None
 
@@ -153,5 +153,5 @@ def subset_kapture(kapture_data: kapture.Kapture,
         trajectories = kapture.Trajectories()
         for timestamp, sensor_or_rig_id, pose in kapture.flatten(kapture_data.trajectories):
             if timestamp in retained_timestamps and sensor_or_rig_id in trajectory_ids:
-                trajectories[timestamp, sensor_or_rig_id] = copy.deepcopy(pose)
+                trajectories[timestamp, sensor_or_rig_id] = copy.copy(pose)
         result.trajectories = trajectories or None
