approved-problems/kapture-dependency-closed-subset/verify/mutants/25-long-options-only.patch
diff --git a/tools/kapture_subset.py b/tools/kapture_subset.py
index 8fd73a6..8eb6737 100644
--- a/tools/kapture_subset.py
+++ b/tools/kapture_subset.py
@@ -10,8 +10,8 @@ from kapture.algo.subset import subset_kapture_from_dir
 
 def subset_command_line() -> None:
     parser = argparse.ArgumentParser(description='create a self-contained subset of a kapture dataset')
-    parser.add_argument('-i', '--input', required=True, help='input kapture dataset')
-    parser.add_argument('-o', '--output', required=True, help='output kapture dataset')
+    parser.add_argument('--input', required=True, help='input kapture dataset')
+    parser.add_argument('--output', required=True, help='output kapture dataset')
     parser.add_argument('--start-timestamp', type=int, help='inclusive lower timestamp bound')
     parser.add_argument('--end-timestamp', type=int, help='inclusive upper timestamp bound')
     parser.add_argument('--sensor', dest='sensors', action='append',
