approved-problems/kapture-dependency-closed-subset/verify/mutants/27-accept-rig-as-sensor-filter.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -87,7 +87,7 @@ def subset_kapture(kapture_data: kapture.Kapture,
                         ({sensor_ids} if isinstance(sensor_ids, str) else set(sensor_ids)))
     selected_images = (None if image_ids is None else
                        ({image_ids} if isinstance(image_ids, str) else set(image_ids)))
-    available_sensors = set(kapture_data.sensors or {})
+    available_sensors = set(kapture_data.sensors or {}) | set(kapture_data.rigs or {})
     if selected_sensors is not None:
         unknown = selected_sensors - available_sensors
         if unknown:

