approved-problems/kapture-dependency-closed-subset/verify/mutants/28-discard-excluded-image-occurrences.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
index 97f31bc..60bbb90 100644
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -137,6 +137,10 @@ def subset_kapture(kapture_data: kapture.Kapture,
         result.trajectories = trajectories or None
 
     retained_images = set(result.records_camera.data_list()) if result.records_camera is not None else set()
+    if kapture_data.records_camera is not None:
+        for timestamp, sensor_id, image_id in kapture.flatten(kapture_data.records_camera):
+            if not _selected(timestamp, sensor_id, start_timestamp, end_timestamp, selected_sensors):
+                retained_images.discard(image_id)
     result.keypoints = _filter_feature_collection(kapture_data.keypoints, retained_images)
     result.descriptors = _filter_feature_collection(kapture_data.descriptors, retained_images)
     result.global_features = _filter_feature_collection(kapture_data.global_features, retained_images)
zsh:1: command not found: python
