approved-problems/kapture-dependency-closed-subset/verify/mutants/29-prune-no-filter-copy.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -101,10 +101,6 @@ def subset_kapture(kapture_data: kapture.Kapture,
         if unknown:
             raise ValueError(f'unknown image identifiers: {sorted(unknown)}')
 
-    if (start_timestamp is None and end_timestamp is None
-            and selected_sensors is None and selected_images is None):
-        return copy.deepcopy(kapture_data)
-
     result = kapture.Kapture()
     result.__version__ = kapture_data.format_version

