approved-problems/kapture-dependency-closed-subset/verify/mutants/31-source-only-install.patch
diff --git a/pyproject.toml b/pyproject.toml
index d7a7a83..80ead8a 100644
--- a/pyproject.toml
+++ b/pyproject.toml
@@ -34,7 +34,7 @@ dependencies = [
 zed = ['pyzed']
 
 [tool.setuptools]
-packages = ['kapture', 'kapture.algo', 'tools']
+packages = ['kapture', 'tools']
 
 
 [project.scripts]
