approved-problems/kapture-dependency-closed-subset/verify/mutants/32-image-filter-camera-only.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -127,5 +127,5 @@ def subset_kapture(kapture_data: kapture.Kapture,
         records = _filter_records(getattr(kapture_data, attribute),
                                   start_timestamp, end_timestamp, selected_sensors,
-                                  image_timestamps,
+                                  image_timestamps if attribute == 'records_camera' else None,
                                   selected_images if attribute == 'records_camera' else None)
         setattr(result, attribute, records)
