approved-problems/kapture-dependency-closed-subset/verify/mutants/33-ignore-unknown-images.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -99,6 +99,6 @@ def subset_kapture(kapture_data: kapture.Kapture,
     if selected_images is not None:
         unknown = selected_images - available_images
         if unknown:
-            raise ValueError(f'unknown image identifiers: {sorted(unknown)}')
+            selected_images -= unknown
 
     if (start_timestamp is None and end_timestamp is None
