approved-problems/kapture-dependency-closed-subset/verify/mutants/34-validate-images-after-other-filters.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -95,6 +95,10 @@ def subset_kapture(kapture_data: kapture.Kapture,
         if unknown:
             raise ValueError(f'unknown sensor identifiers: {sorted(unknown)}')
 
-    available_images = set(kapture_data.records_camera.data_list()) if kapture_data.records_camera else set()
+    available_images = {
+        image_id
+        for timestamp, sensor_id, image_id in kapture.flatten(kapture_data.records_camera)
+        if _selected(timestamp, sensor_id, start_timestamp, end_timestamp, selected_sensors)
+    } if kapture_data.records_camera else set()
     if selected_images is not None:
         unknown = selected_images - available_images
