approved-problems/kapture-dependency-closed-subset/verify/mutants/35-publish-partial-fresh-output.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -326,4 +326,6 @@ def subset_kapture_from_dir(source_path: str,
         shutil.rmtree(backup_path, ignore_errors=True)
         return result
     finally:
+        if not output_existed and path.isdir(staged_path):
+            os.replace(staged_path, output_path)
         shutil.rmtree(transaction_root, ignore_errors=True)

