approved-problems/kapture-dependency-closed-subset/verify/mutants/36-eager-force-cleanup.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -375,6 +375,8 @@ def subset_kapture_from_dir(source_path: str,
         managed_files = _existing_managed_files(output_path) if output_existed else set()
         if managed_files and not force:
             raise ValueError('output already contains kapture data; use force to replace it')
+        if managed_files and force:
+            _remove_managed_files(output_path, managed_files)
 
         with get_all_tar_handlers(source_path) as source_tars:
             source = kapture_from_dir(source_path, tar_handlers=source_tars)

