approved-problems/kapture-dependency-closed-subset/verify/mutants/37-force-drops-unrelated-files.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -388,7 +388,10 @@ def subset_kapture_from_dir(source_path: str,
             os.replace(staged_path, output_path)
             return result
 
-        shutil.copytree(output_path, candidate_path, symlinks=True)
+        if force:
+            os.makedirs(candidate_path)
+        else:
+            shutil.copytree(output_path, candidate_path, symlinks=True)
         _remove_managed_files(candidate_path, managed_files)
         shutil.copytree(staged_path, candidate_path, dirs_exist_ok=True)
 
