approved-problems/kapture-dependency-closed-subset/verify/mutants/38-cli-ignores-image-seeds.patch
diff --git a/tools/kapture_subset.py b/tools/kapture_subset.py
index 8fd73a6..1111111 100644
--- a/tools/kapture_subset.py
+++ b/tools/kapture_subset.py
@@ -24,6 +24,6 @@ def subset_command_line() -> None:
     subset_kapture_from_dir(args.input, args.output, args.start_timestamp,
-                            args.end_timestamp, args.sensors, args.images, args.force)
+                            args.end_timestamp, args.sensors, None, args.force)
 
 
 if __name__ == '__main__':
     subset_command_line()
