approved-problems/kapture-dependency-closed-subset/verify/mutants/39-keep-stale-managed-payloads.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -389,7 +389,6 @@ def subset_kapture_from_dir(source_path: str,
             return result
 
         shutil.copytree(output_path, candidate_path, symlinks=True)
-        _remove_managed_files(candidate_path, managed_files)
         shutil.copytree(staged_path, candidate_path, dirs_exist_ok=True)
 
         os.replace(output_path, backup_path)

