approved-problems/kapture-dependency-closed-subset/verify/mutants/40-delete-whole-managed-roots.patch
diff --git a/kapture/algo/subset.py b/kapture/algo/subset.py
--- a/kapture/algo/subset.py
+++ b/kapture/algo/subset.py
@@ -19,6 +19,7 @@ from kapture.io.binary import TransferAction
 from kapture.io.records import get_record_fullpath, import_record_data_from_dir_auto
 from kapture.io.tar import (TarCollection, TarHandler, get_feature_tar_fullpath,
                             retrieve_tar_handler_from_collection)
+from kapture.io.structure import delete_existing_kapture_files
 
 
 RECORD_ATTRIBUTES = (
@@ -389,7 +390,7 @@ def subset_kapture_from_dir(source_path: str,
             return result
 
         shutil.copytree(output_path, candidate_path, symlinks=True)
-        _remove_managed_files(candidate_path, managed_files)
+        delete_existing_kapture_files(candidate_path, force_erase=True)
         shutil.copytree(staged_path, candidate_path, dirs_exist_ok=True)
 
         os.replace(output_path, backup_path)

